InformationRegisters/ОчередьИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьИнтеграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОчередиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Внешний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОчередиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОчередиИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЮклайнсОчередьСервер/Ext/Module.bsl
// Добавляет новые записи в регистр очереди интеграции пачкой в одной транзакции.
//
// Параметры:
//   МассивПараметров - Массив из Структура - массив структур для создания записей. 
//                        Структура должна содержать свойства: ТипОбъекта, ID_Внешний, ДанныеJSON
Процедура НовыеЗаписиВРегистрОчедери(МассивПараметров) Экспорт
	НачатьТранзакцию();
	
	Попытка
		Для Каждого Элемент Из МассивПараметров Цикл
			Параметры = Новый Структура;
			Параметры.Вставить("ТипОбъекта", Элемент.ТипОбъекта);
			Параметры.Вставить("ID_Внешний", Элемент.ID_Внешний);
			Параметры.Вставить("ДанныеJSON", Элемент.ДанныеJSON);
			Параметры.Вставить("ДатаСоздания", ТекущаяДата());
            Параметры.Вставить("Статус",       Перечисления.СтатусыОчередиИнтеграции.Новый);
            Параметры.Вставить("ТекстОшибки",  "");
			Параметры.Вставить("Период", ТекущаяДата());
			ЗаписатьВРегитрОчередиИнтеграция(Параметры);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ДанныеЛога = Новый Структура("Объект, Сообщение, ДопДанные", РегистрыСведений.ОчередьИнтеграции, "Ошибка в записи РС Очереди Интеграции пачкой", ОписаниеОшибки());
		ЛогированиеПриложений.Ошибка("НовыеЗаписиВРегистрОчедери.Ошибка", ДанныеЛога);
	КонецПопытки;
КонецПроцедуры

// Создает новую запись в регистре очереди интеграции с указанными параметрами.
//
// Параметры:
//   ТипОбъекта - Строка - тип объекта интеграции
//   ID_Внешний - Строка - внешний идентификатор объекта
//   ДанныеJSON - Строка - данные в формате JSON
//   Статус - Перечисления.СтатусыОчередиИнтеграции - статус записи, по умолчанию Новый
//   ТекстОшибки - Строка - текст ошибки при обработке записи
Процедура НоваяЗаписьВРегистрОчереди(ТипОбъекта, ID_Внешний, ДанныеJSON, Статус = Неопределено, ТекстОшибки = "") Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("ТипОбъекта", ТипОбъекта);
	Параметры.Вставить("ID_Внешний", ID_Внешний);
	Параметры.Вставить("ДанныеJSON", ДанныеJSON);
	Параметры.Вставить("ДатаСоздания", ТекущаяДата());
	Параметры.Вставить("Статус", ?(Статус = Неопределено, Перечисления.СтатусыОчередиИнтеграции.Новый, Статус));
	Параметры.Вставить("ТекстОшибки", ТекстОшибки);
	Параметры.Вставить("Период", ТекущаяДата());
	ЗаписатьВРегитрОчередиИнтеграция(Параметры);
КонецПроцедуры

// Записывает или обновляет запись в регистре сведений ОчередьИнтеграции, сохраняя дату создания при перезаписи.
//
// Параметры:
//   СтруктураПараметров - Структура - параметры для записи в регистр
//     * ТипОбъекта - Произвольный - тип интегрируемого объекта
//     * ID_Внешний - Строка - внешний идентификатор объекта
//     * ДанныеJSON - Строка - данные объекта в формате JSON
//     * Статус - Произвольный - статус обработки записи
//     * ТекстОшибки - Строка - текст ошибки при обработке
Процедура ЗаписатьВРегитрОчередиИнтеграция(СтруктураПараметров)
	НаборЗаписи = РегистрыСведений.ОчередьИнтеграции.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.ТипОбъекта.Установить(СтруктураПараметров.ТипОбъекта);
	НаборЗаписи.Отбор.ID_Внешний.Установить(СтруктураПараметров.ID_Внешний);
    СохранитьДатуСоздания = Неопределено;
	НаборЗаписи.Прочитать();
	Если НаборЗаписи.Количество() > 0 Тогда
        СохранитьДатуСоздания = НаборЗаписи[0].ДатаСоздания;
    КонецЕсли;
	НаборЗаписи.Очистить();
	Запись = НаборЗаписи.Добавить();
	Запись.ТипОбъекта = СтруктураПараметров.ТипОбъекта;
	Запись.ID_Внешний = СтруктураПараметров.ID_Внешний;
	Запись.ДанныеJSON = СтруктураПараметров.ДанныеJSON;
	Запись.Статус = СтруктураПараметров.Статус;
	Запись.ТекстОшибки = СтруктураПараметров.ТекстОшибки;
	
	Если СохранитьДатуСоздания = Неопределено Тогда
		Запись.ДатаСоздания = ТекущаяДатаСеанса();
	Иначе
		Запись.ДатаСоздания = СохранитьДатуСоздания;
	КонецЕсли;
	
	Попытка
		НаборЗаписи.Записать(Истина);
	Исключение
		ДанныеЛога = Новый Структура("Объект, Сообщение, ДопДанные", РегистрыСведений.ОчередьИнтеграции, "Ошибка в записи РС Очереди Интеграции", ОписаниеОшибки());
		ЛогированиеПриложений.Ошибка("ЗаписатьВРегитрОчередиИнтеграция.Ошибка", ДанныеЛога);
	КонецПопытки;
КонецПроцедуры
